[
  {
    "id": "TC-01",
    "title": "Duplicate Container Information Alert",
    "summary": "Customer reports receiving duplicate container information for container CMAU0000020 on PORTNET. The system should ensure unique container data is maintained and prevent duplicates.",
    "signals": [
      "container CMAU0000020",
      "duplicate container information",
      "PORTNET"
    ],
    "category": "CNTR",
    "rationale": "Investigate incidents involving duplicate container information for container CMAU0000020 reported on PORTNET to identify causes and resolutions in container services."
  },
  {
    "id": "TC-02",
    "title": "Vessel Name Conflict Error",
    "summary": "Customer unable to create vessel advice for MV Lion City 07 due to error VESSEL_ERR_4 indicating the vessel name is already used by another vessel advice. The system should prevent duplicate vessel names in advice creation.",
    "signals": [
      "VESSEL_ERR_4",
      "MV Lion City 07",
      "vessel advice",
      "system vessel name"
    ],
    "category": "VS",
    "rationale": "Search for issues related to vessel advice creation errors caused by duplicate system vessel names, specifically error VESSEL_ERR_4 for MV Lion City 07."
  },
  {
    "id": "TC-03",
    "title": "EDI Message Stuck in Error Status",
    "summary": "EDI message with reference IFT-0007 is stuck in ERROR status with no acknowledgment sent. The system should process EDI messages correctly and send acknowledgments to avoid stuck states.",
    "signals": [
      "EDI message",
      "REF -IFT-0007",
      "ERROR status",
      "No acknowledgment",
      "LINE -PSA",
      "PSA -TOS"
    ],
    "category": "EA",
    "rationale": "Identify and resolve issues causing EDI messages like IFT-0007 to remain in error status without acknowledgments, affecting API and EDI service reliability."
  },
  {
    "id": "TC-04",
    "title": "BAPLIE Inconsistency for Vessel Load Plan",
    "summary": "Vessel MV PACIFIC DAWN/07E shows inconsistency where COARRI indicates load completed for bay 14 but BAPLIE still lists units in those slots, with an older timestamp regressing the plan. The system should synchronize load status across data sources.",
    "signals": [
      "MV PACIFIC DAWN/07E",
      "BAPLIE inconsistency",
      "COARRI",
      "load completed",
      "bay 14",
      "Pasir Panjang Terminal 4"
    ],
    "category": "CNTR",
    "rationale": "Investigate synchronization issues between COARRI and BAPLIE data causing load plan inconsistencies for vessel MV PACIFIC DAWN/07E at Pasir Panjang Terminal 4."
  }
]